DataProcessors/РабочееМестоПоСопоставлению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоПоСопоставлению</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СоответствиеДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеДоговоров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорИзУчетнойСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеПодразделений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыДоговоровПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыДоговоровПроектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тестируемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Планируемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполняемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Просроченный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмененный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приоритетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполненный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДТ1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДТ2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДТ3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДТ4</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/РабочееМестоПоСопоставлению/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Константы.ОрганизацияПоУмолчанию.Получить();
	
	Элементы.ТаблицаСоответвтсияОтборВсе.Пометка							= Истина;	
	Элементы.ТаблицаСоответвтсияОтборТолькоСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеКЛАДО.Пометка	= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеУС.Пометка		= Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСоответствия(ТипСправочника)
	
	Если Не ЗначениеЗаполнено(ТипСправочника) Тогда 
		Сообщить("Не выбран тип справочника!");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("БезОтбора", НЕ ЗначениеЗаполнено(Контрагент));
	Если ТипСправочника = "1" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	СоответсвиеРС.Договор КАК Элемент,
		               |	СоответсвиеРС.ДоговорИзУчетнойСистемы КАК ЭлементУчетнойСистемы
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	РегистрСведений.СоответствиеДоговоров КАК СоответсвиеРС
		               |ГДЕ
		               |	СоответсвиеРС.Организация = &Организация
		               |	И (СоответсвиеРС.Договор.Контрагент = &Контрагент
		               |			ИЛИ &БезОтбора)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Элемент КАК Элемент,
		               |	ВТ.ЭлементУчетнойСистемы КАК ЭлементУчетнойСистемы,
		               |	ИСТИНА КАК ЕстьСоответствие,
		               |	ВТ.Элемент.Контрагент КАК Владелец,
		               |	ВТ.ЭлементУчетнойСистемы.Владелец КАК ВладелецУС,
		               |	ВТ.ЭлементУчетнойСистемы.НомерДоговора КАК НомерДоговора,
		               |	ВТ.ЭлементУчетнойСистемы.Код КАК КодДоговора
		               |ИЗ
		               |	ВТ КАК ВТ
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Таблица.Ссылка,
		               |	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка),
		               |	ЛОЖЬ,
		               |	Таблица.Контрагент,
		               |	НЕОПРЕДЕЛЕНО,
		               |	"""",
		               |	""""
		               |ИЗ
		               |	Справочник.Договоры КАК Таблица
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		               |		ПО (ВТ.Элемент = Таблица.Ссылка)
		               |ГДЕ
		               |	ВТ.ЭлементУчетнойСистемы ЕСТЬ NULL
		               |	И (Таблица.Контрагент = &Контрагент
		               |			ИЛИ &БезОтбора)
		               |	И НЕ Таблица.СостояниеИсполнения = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровПроектов.Планируемый)
		               |	И НЕ Таблица.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ДТ4)
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
		               |	ТаблицаУС.Ссылка,
		               |	ЛОЖЬ,
		               |	НЕОПРЕДЕЛЕНО,
		               |	ТаблицаУС.Владелец,
		               |	ТаблицаУС.НомерДоговора,
		               |	ТаблицаУС.Код
		               |ИЗ
		               |	Справочник.ДоговорыКонтрагентов КАК ТаблицаУС
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		               |		ПО ТаблицаУС.Ссылка = ВТ.ЭлементУчетнойСистемы
		               |ГДЕ
		               |	ВТ.Элемент ЕСТЬ NULL
		               |	И (ТаблицаУС.Владелец = &Контрагент
		               |			ИЛИ &БезОтбора)";
	ИначеЕсли ТипСправочника = "2" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	СоответствиеПодразделений.Организация КАК Организация,
		               |	СоответствиеПодразделений.Подразделение КАК Элемент,
		               |	СоответствиеПодразделений.ПодразделениеОрганизации КАК ЭлементУчетнойСистемы
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	РегистрСведений.СоответствиеПодразделений КАК СоответствиеПодразделений
		               |ГДЕ
		               |	СоответствиеПодразделений.Организация = &Организация
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Элемент КАК Элемент,
		               |	ВТ.ЭлементУчетнойСистемы КАК ЭлементУчетнойСистемы,
		               |	ИСТИНА КАК ЕстьСоответствие,
		               |	ВТ.Организация КАК Владелец,
		               |	ВТ.Организация КАК ВладелецУС
		               |ИЗ
		               |	ВТ КАК ВТ
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	Подразделения.Ссылка,
		               |	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
		               |	ЛОЖЬ,
		               |	Подразделения.Владелец,
		               |	Неопределено
		               |ИЗ
		               |	Справочник.Подразделения КАК Подразделения
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		               |		ПО Подразделения.Ссылка = ВТ.Элемент
		               |ГДЕ
		               |	ВТ.ЭлементУчетнойСистемы ЕСТЬ NULL
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка),
		               |	ПодразделенияОрганизаций.Ссылка,
		               |	ЛОЖЬ,
		               |	Неопределено,
		               |	ПодразделенияОрганизаций.Владелец
		               |ИЗ
		               |	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
		               |		ПО ПодразделенияОрганизаций.Ссылка = ВТ.ЭлементУчетнойСистемы
		               |ГДЕ
		               |	ВТ.Элемент ЕСТЬ NULL";
	КонецЕсли;
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "СоответствиеДоговоров", ИмяТаблицыРС);
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ДоговорыКонтрагентов", "Справочник."+ИмяТаблицаЭлементаУС);
	//Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Договоры", "Справочник."+ИмяТаблицаЭлемента);
	//
	//Если ТипСправочника = "2" Тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СоответсвиеРС.Договор КАК Элемент", "СоответсвиеРС.Подразделение КАК Элемент");
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СоответсвиеРС.ДоговорИзУчетнойСистемы КАК ЭлементУчетнойСистемы", "СоответсвиеРС.ПодразделениеОрганизации КАК ЭлементУчетнойСистемы");
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СоответсвиеРС.Договор.Контрагент = &Контрагент И СоответсвиеРС.ДоговорИзУчетнойСистемы.Владелец = &Контрагент", "");	
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТаблицаУС.Владелец = &Контрагент", "");	
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Таблица.Контрагент = &Контрагент", "");	
	//КонецЕсли;
	
	ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "ТаблицаСоответствия");
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСправочникаПриИзменении(Элемент)
	Если ТипСправочника = "" Тогда
		Возврат;
	КонецЕсли;
	Если ТипСправочника = "1" Тогда
		ИмяТаблицаЭлемента = "Договоры";
		ИмяТаблицаЭлементаУС = "ДоговорыКонтрагентов";
		ИмяТаблицыРС = "СоответствиеДоговоров";
		Элементы.Контрагент.Видимость = Истина;
		Элементы.ТаблицаСоответвтсияНомерДоговора.Видимость = Истина;
		Элементы.ТаблицаСоответвтсияКодДоговора.Видимость = Истина;
	ИначеЕсли ТипСправочника = "2" Тогда
		ИмяТаблицаЭлемента = "Подразделения";
		ИмяТаблицаЭлементаУС = "ПодразделенияОрганизаций";
		ИмяТаблицыРС = "СоответствиеПодразделений";
		Элементы.Контрагент.Видимость = Ложь;
		Элементы.ТаблицаСоответвтсияНомерДоговора.Видимость = Ложь;
		Элементы.ТаблицаСоответвтсияКодДоговора.Видимость = Ложь;
	КонецЕсли;
	ЗаполнитьТаблицуСоответствия(ТипСправочника);
	Элементы.ТаблицаСоответвтсияОтборВсе.Пометка							= Истина;	
	Элементы.ТаблицаСоответвтсияОтборТолькоСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеКЛАДО.Пометка	= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеУС.Пометка		= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответвтсияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = ТаблицаСоответствия.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ТекПоле = Сред(Поле.Имя, 20);
	Если ЗначениеЗаполнено(ТекущиеДанные[ТекПоле]) тогда
		ПоказатьЗначение(,ТекущиеДанные[текПоле]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСоответствие(Команда)
	ТекущиеДанные = Элементы.ТаблицаСоответвтсия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Строка не выбрана!");
		Возврат;
	КонецЕсли;
	Если НЕ ТекущиеДанные.ЕстьСоответствие Тогда
		Возврат
	КонецЕсли;
	ОтменитьСоответствиеНаСервере(ТекущиеДанные.Элемент, ТекущиеДанные.ЭлементУчетнойСистемы);
	ЗаполнитьТаблицуСоответствия(ТипСправочника);
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьСоответствиеНаСервере(Элемент, ЭлементУС)
	
	Если ТипСправочника = "1" Тогда
		МЗ = РегистрыСведений.СоответствиеДоговоров.СоздатьМенеджерЗаписи();
		МЗ.Организация = Организация;
		МЗ.Договор = Элемент;
		МЗ.ДоговорИзУчетнойСистемы = ЭлементУС;
		МЗ.Удалить();
	ИначеЕсли ТипСправочника = "2" Тогда
		МЗ = РегистрыСведений.СоответствиеПодразделений.СоздатьМенеджерЗаписи();
		МЗ.Организация = Организация;
		МЗ.Подразделение = Элемент;
		МЗ.ПодразделениеОрганизации = ЭлементУС;
		МЗ.Удалить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСоответвтсиеНаСервере(Элемент, ЭлементУС)
	Если ТипСправочника = "1" Тогда
		МЗ = РегистрыСведений.СоответствиеДоговоров.СоздатьМенеджерЗаписи();
		МЗ.Организация = Организация;
		МЗ.Договор = Элемент;
		МЗ.ДоговорИзУчетнойСистемы = ЭлементУС;
		МЗ.Записать(Истина);
	ИначеЕсли ТипСправочника = "2" Тогда
		МЗ = РегистрыСведений.СоответствиеПодразделений.СоздатьМенеджерЗаписи();
		МЗ.Организация = Организация;
		МЗ.Подразделение = Элемент;
		МЗ.ПодразделениеОрганизации = ЭлементУС;
		МЗ.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответвтсие(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаСоответвтсия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, "Строка не выбрана!");
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ЕстьСоответствие Тогда
		Возврат;                                                      
	КонецЕсли;
	
	
	Если ТипСправочника = "1" Тогда //Договоры
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Элемент) Тогда
			
			ПараметрыВыбора = Новый Структура("РежимВыбора",Истина);
			ОткрытьФорму("Справочник.Договоры.ФормаВыбора",ПараметрыВыбора,ЭтаФорма);	
			
		ИначеЕсли Не ЗначениеЗаполнено(ТекущиеДанные.ЭлементУчетнойСистемы) Тогда 
			
			ПараметрыВыбора = Новый Структура("РежимВыбора",Истина);
			ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора",ПараметрыВыбора,ЭтаФорма);
			
		КонецЕсли;		
		
	Иначе
		
		СторонаЗаполнения = ?(ЗначениеЗаполнено(ТекущиеДанные.Элемент), 1, 2);
		Стр = Новый Структура("СторонаЗаполнения, Элемент, ЭлементУчетнойСистемы", СторонаЗаполнения, ТекущиеДанные.Элемент, ТекущиеДанные.ЭлементУчетнойСистемы);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗавершение", ЭтаФорма, Стр);
		ТекВладелец = ?(СторонаЗаполнения = 1, ТекущиеДанные.Владелец, ТекущиеДанные.ВладелецУС);
		
		ОткрытьФорму("Обработка.РабочееМестоПоСопоставлению.Форма.ФормаСписка", Новый Структура("Список", ПолучитьСписокЭлементовДляВыбора(СторонаЗаполнения, ТекВладелец)),ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//УстановитьСоответвтсиеНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекЭлемент = ?(ДопПараметры.СторонаЗаполнения = 1, ДопПараметры.Элемент, Результат); 
	ТекЭлементУС = ?(ДопПараметры.СторонаЗаполнения = 1, Результат, ДопПараметры.ЭлементУчетнойСистемы); 
	УстановитьСоответвтсиеНаСервере(ТекЭлемент, ТекЭлементУС);
	
	Если Элементы.ТаблицаСоответвтсияОтборВсе.Пометка Тогда 
		ОтборВсе(Неопределено);
	ИначеЕсли Элементы.ТаблицаСоответвтсияОтборТолькоСопоставленные.Пометка Тогда 
		ОтборТолькоСопоставленные(Неопределено);
	ИначеЕсли Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленные.Пометка Тогда
		ОтборТолькоНеСопоставленные(Неопределено)
	ИначеЕсли Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеКЛАДО.Пометка Тогда
		ОтборТолькоНеСопоставленныеКЛАДО(Неопределено);
	ИначеЕсли Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеУС.Пометка Тогда
		ОтборТолькоНеСопоставленныеУС(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокЭлементовДляВыбора(СторонаЗаполнения, ТекВладелец)
	ИмяКолонки = ?(СторонаЗаполнения=1, "ЭлементУчетнойСистемы", "Элемент");
	ИмяКолонкиВладелец = ?(СторонаЗаполнения=1, "ВладелецУС", "Владелец");
	Массив = Новый Массив;
	Для Каждого Стр ИЗ ТаблицаСоответствия Цикл
		Если НЕ Стр.ЕстьСоответствие И ЗначениеЗаполнено(Стр[ИмяКолонки]) Тогда 
			//И ТекВладелец = Стр[ИмяКолонкиВладелец] Тогда
			Массив.Добавить(Стр[ИмяКолонки]);
		КонецЕсли;
	КонецЦикла;
	Возврат Массив;	
КонецФункции

&НаКлиенте
Процедура ТаблицаСоответвтсияПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если Строка = Неопределено тогда
		Возврат
	КонецЕсли;
	ТекущиеДанные = ТаблицаСоответствия.НайтиПоИдентификатору(Строка);
	Если НЕ ТекущиеДанные.ЕстьСоответствие Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответвтсияПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	ТекущиеДанныеИсточник = ТаблицаСоответствия.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
	ТекущиеДанные = ТаблицаСоответствия.НайтиПоИдентификатору(Строка);
	Если ТекущиеДанные.ЕстьСоответствие
		ИЛИ ТекущиеДанныеИсточник.ЕстьСоответствие Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущиеДанные.Элемент) И ЗначениеЗаполнено(ТекущиеДанныеИсточник.Элемент) Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущиеДанные.ЭлементУчетнойСистемы) И ЗначениеЗаполнено(ТекущиеДанныеИсточник.ЭлементУчетнойСистемы) Тогда
		Возврат;
	КонецЕсли;
	ТекВладелец = ?(ЗначениеЗаполнено(ТекущиеДанные.Владелец), ТекущиеДанные.Владелец, ТекущиеДанныеИсточник.Владелец); 
	ТекВладелецУС = ?(ЗначениеЗаполнено(ТекущиеДанные.ВладелецУС), ТекущиеДанные.ВладелецУС, ТекущиеДанныеИсточник.ВладелецУС); 
	Если ТекВладелецУС <> ТекВладелец Тогда
		Возврат;
	КонецЕсли;
	ТекЭлемент = ?(ЗначениеЗаполнено(ТекущиеДанные.Элемент), ТекущиеДанные.Элемент, ТекущиеДанныеИсточник.Элемент); 
	ТекЭлементУС = ?(ЗначениеЗаполнено(ТекущиеДанные.ЭлементУчетнойСистемы), ТекущиеДанные.ЭлементУчетнойСистемы, ТекущиеДанныеИсточник.ЭлементУчетнойСистемы); 
	УстановитьСоответвтсиеНаСервере(ТекЭлемент, ТекЭлементУС);
	ЗаполнитьТаблицуСоответствия(ТипСправочника);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответвтсияНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	ТекущиеДанныеИсточник = ТаблицаСоответствия.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
	Если ТекущиеДанныеИсточник.ЕстьСоответствие Тогда
		Выполнение = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьТаблицуСоответствия(ТипСправочника);
	Элементы.ТаблицаСоответвтсияОтборВсе.Пометка							= Истина;	
	Элементы.ТаблицаСоответвтсияОтборТолькоСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеКЛАДО.Пометка	= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеУС.Пометка		= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ТипСправочникаПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Договоры") Тогда
		УстановитьСоответвтсиеНаСервере(ВыбранноеЗначение, Элементы.ТаблицаСоответвтсия.ТекущиеДанные.ЭлементУчетнойСистемы);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда 
		УстановитьСоответвтсиеНаСервере(Элементы.ТаблицаСоответвтсия.ТекущиеДанные.Элемент, ВыбранноеЗначение);
	КонецЕсли;
	
	Если Элементы.ТаблицаСоответвтсияОтборВсе.Пометка Тогда 
		ОтборВсе(Неопределено);
	ИначеЕсли Элементы.ТаблицаСоответвтсияОтборТолькоСопоставленные.Пометка Тогда 
		ОтборТолькоСопоставленные(Неопределено);
	ИначеЕсли Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленные.Пометка Тогда
		ОтборТолькоНеСопоставленные(Неопределено)
	ИначеЕсли Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеКЛАДО.Пометка Тогда
		ОтборТолькоНеСопоставленныеКЛАДО(Неопределено);
	ИначеЕсли Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеУС.Пометка Тогда
		ОтборТолькоНеСопоставленныеУС(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#Область Отборы

&НаКлиенте
Процедура ОтборВсе(Команда)
	
	ЗаполнитьТаблицуСоответствия(ТипСправочника);	
	Элементы.ТаблицаСоответвтсияОтборВсе.Пометка							= Истина;	
	Элементы.ТаблицаСоответвтсияОтборТолькоСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеКЛАДО.Пометка	= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеУС.Пометка		= Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТолькоСопоставленные(Команда)
	
	ЗаполнитьТаблицуСоответствия(ТипСправочника);
	СписокНаУдаление = Новый Массив;
	
	Для Каждого Стр Из ТаблицаСоответствия Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Элемент) ИЛИ НЕ ЗначениеЗаполнено(Стр.ЭлементУчетнойСистемы) Тогда
			СписокНаУдаление.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрНаУдаление Из СписокНаУдаление Цикл 
		ТаблицаСоответствия.Удалить(СтрНаУдаление);			
	КонецЦикла;
	
	Элементы.ТаблицаСоответвтсияОтборВсе.Пометка							= Ложь;	
	Элементы.ТаблицаСоответвтсияОтборТолькоСопоставленные.Пометка			= Истина;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеКЛАДО.Пометка	= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеУС.Пометка		= Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТолькоНеСопоставленные(Команда)
		
	ЗаполнитьТаблицуСоответствия(ТипСправочника);
	СписокНаУдаление = Новый Массив;
	
	Для Каждого Стр Из ТаблицаСоответствия Цикл
		Если ЗначениеЗаполнено(Стр.Элемент) И ЗначениеЗаполнено(Стр.ЭлементУчетнойСистемы) Тогда
			СписокНаУдаление.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрНаУдаление Из СписокНаУдаление Цикл 
		ТаблицаСоответствия.Удалить(СтрНаУдаление);			
	КонецЦикла;
	
	Элементы.ТаблицаСоответвтсияОтборВсе.Пометка							= Ложь;	
	Элементы.ТаблицаСоответвтсияОтборТолькоСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленные.Пометка			= Истина;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеКЛАДО.Пометка	= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеУС.Пометка		= Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТолькоНеСопоставленныеКЛАДО(Команда)
	
	ЗаполнитьТаблицуСоответствия(ТипСправочника);
	СписокНаУдаление = Новый Массив;
	
	Для Каждого Стр Из ТаблицаСоответствия Цикл
		Если НЕ (ЗначениеЗаполнено(Стр.Элемент) И НЕ ЗначениеЗаполнено(Стр.ЭлементУчетнойСистемы)) Тогда
			СписокНаУдаление.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрНаУдаление Из СписокНаУдаление Цикл 
		ТаблицаСоответствия.Удалить(СтрНаУдаление);			
	КонецЦикла;
	
	Элементы.ТаблицаСоответвтсияОтборВсе.Пометка							= Ложь;	
	Элементы.ТаблицаСоответвтсияОтборТолькоСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеКЛАДО.Пометка	= Истина;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеУС.Пометка		= Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборТолькоНеСопоставленныеУС(Команда)
	
	ЗаполнитьТаблицуСоответствия(ТипСправочника);
	СписокНаУдаление = Новый Массив;
	
	Для Каждого Стр Из ТаблицаСоответствия Цикл
		Если НЕ (НЕ ЗначениеЗаполнено(Стр.Элемент) И ЗначениеЗаполнено(Стр.ЭлементУчетнойСистемы)) Тогда
			СписокНаУдаление.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрНаУдаление Из СписокНаУдаление Цикл 
		ТаблицаСоответствия.Удалить(СтрНаУдаление);			
	КонецЦикла;
	
	Элементы.ТаблицаСоответвтсияОтборВсе.Пометка							= Ложь;	
	Элементы.ТаблицаСоответвтсияОтборТолькоСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленные.Пометка			= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеКЛАДО.Пометка	= Ложь;
	Элементы.ТаблицаСоответвтсияОтборТолькоНеСопоставленныеУС.Пометка		= Истина;
	
КонецПроцедуры

#КонецОбласти
